In [3]:
import pandas as pd
import numpy as np

#ignore warnings
import warnings
warnings.filterwarnings('ignore')

import matplotlib as plt
%matplotlib inline

import seaborn as sns

### 데이터셋 확인

In [2]:
df_train = pd.read_csv("./titanic/train.csv")
df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### 탐색적 데이터 분석(exploratory data analysis)EDA
피처를 구분하는 작업

In [3]:
df_train .shape

(891, 12)

In [4]:
df_train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

##### 여기에 나와있지 않은 데이터는 object 데이터, string 데이터

In [5]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [6]:
df_train.columns #컬럼정보

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [7]:
list =[]
for col in df_train.columns:
    print(col, df_train[col].isnull().sum())
    list.append(col)

PassengerId 0
Survived 0
Pclass 0
Name 0
Sex 0
Age 177
SibSp 0
Parch 0
Ticket 0
Fare 0
Cabin 687
Embarked 2

In [8]:
#비율 몇퍼센트 차지하는지 확인
list =[]
for col in df_train.columns:
    print("{}\t{}\t{:.1f}\t".format(col, df_train[col].isnull().sum(),df_train.shape[0]*100))
#     list.append(col)

PassengerId	0	89100.0
Survived	0	89100.0
Pclass	0	89100.0
Name	0	89100.0
Sex	0	89100.0
Age	177	89100.0
SibSp	0	89100.0
Parch	0	89100.0
Ticket	0	89100.0
Fare	0	89100.0
Cabin	687	89100.0
Embarked	2	89100.0

In [9]:
#결측값 처리
df_train["Age"].fillna(df_train["Age"].mean(), inplace = True)
df_train["Cabin"].fillna("N", inplace=True)
df_train["Embarked"].fillna("N", inplace = True)

In [10]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        891 non-null    object
 11  Embarked     891 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [11]:
print(df_train.isnull().sum().sum())

0

In [12]:
list

[]

In [13]:
#del df_train[""]
#df_train.drop(labels="", axis=0) axis, 가로를 지울거냐 세로를 지울거냐
#df_train.drop(labels="", axis=1)
#prop()
df_train = df_train.drop(labels="PassengerId", axis=1)
#inplace =False,로 하면 담아두지 않아도 된다, 그냥 바로 삭제를 반영한다.

# df_train.drop(labels="PassengerId", axis=1, inplace=True)

In [14]:
df_train

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,N,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,N,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,N,S
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,"Montvila, Rev. Juozas",male,27.000000,0,0,211536,13.0000,N,S
887,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0,112053,30.0000,B42,S
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,1,2,W./C. 6607,23.4500,N,S
889,1,1,"Behr, Mr. Karl Howell",male,26.000000,0,0,111369,30.0000,C148,C
890,0,3,"Dooley, Mr. Patrick",male,32.000000,0,0,370376,7.7500,N,Q

In [15]:
df_train["Survived"].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [16]:
df_train[["Pclass","Survived"]].value_counts()

Pclass  Survived
3       0           372
1       1           136
3       1           119
2       0            97
        1            87
1       0            80
dtype: int64

In [17]:
df_train[["Pclass","Survived"]].groupby(["Pclass"]).count()

        Survived
Pclass
1            216
2            184
3            491

In [18]:
df_train[["Pclass","Survived"]].groupby(["Pclass"]).sum()

        Survived
Pclass
1            136
2             87
3            119

In [19]:
df_train[["Sex","Survived"]].groupby(["Sex"]).sum()

        Survived
Sex
female       233
male         109

In [20]:
df_train[["Pclass","Survived"]].groupby(["Pclass"]).sum().sort_values(by="Survived",ascending=False)

        Survived
Pclass
1            136
3            119
2             87

### 정규표현식

In [21]:
df_train["MM"]=df_train["Name"].str.extract("([a-zA-Z]+)\.")
df_train["MM"].value_counts()#데이터 구경

Mr          517
Miss        182
Mrs         125
Master       40
Dr            7
Rev           6
Mlle          2
Major         2
Col           2
Sir           1
Ms            1
Don           1
Lady          1
Capt          1
Jonkheer      1
Mme           1
Countess      1
Name: MM, dtype: int64

In [22]:
#EDA에 들어가면 밑에 애들을 처리해줘야 한다.
df_train[["MM","Survived"]].groupby(["MM"]).sum().sort_values(by="Survived",ascending = False)

          Survived
MM
Miss           127
Mrs             99
Mr              81
Master          23
Dr               3
Mlle             2
Ms               1
Mme              1
Sir              1
Col              1
Major            1
Lady             1
Countess         1
Jonkheer         0
Don              0
Rev              0
Capt             0

In [23]:
df_train["Age"]

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: Age, Length: 891, dtype: float64

In [24]:
df_train["Age"].describe()#1.Mr Mrs이런거로 구분한다. 그다음에 중간나이, 평균으로 채워넣고 ㅇㅇ

count    891.000000
mean      29.699118
std       13.002015
min        0.420000
25%       22.000000
50%       29.699118
75%       35.000000
max       80.000000
Name: Age, dtype: float64

In [25]:
def age_class(Age):
    if Age >=0 and Age < 20 :
        return   1
    if Age >=20 and Age < 40 :
        return    2
    if Age >=40 and Age < 60 :
        return    3
    else:
        return 4

In [26]:
df_train['Age_class']=df_train['Age'].apply(age_class)

In [27]:
df_train2 = pd.read_csv("./titanic/train.csv")

* Feature Transforming : Binning(이산형 -> 범주형으로 구간화)

In [28]:
#lambda 함수
# map(lambda x: int(x) if x > 20 == 2 else int(x) if x >40))
df_train2['Age_class']=df_train2['Age'].apply(lambda x: 1 
                                              if x>0 and x<20 
                                              else 2 if x>=20 and x <40 
                                              else 3 if x>=40 and x<60 
                                              else 4 )

In [29]:
df_train2.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_class
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,2

In [30]:
df_train2['Age_class'] = df_train2['Age'].apply(lambda x:1
                                               if x<20
                                               else 2 if x<40 
                                               else 3 if x<60
                                               else 4)

In [31]:
df_train2['Age_class']

0      2
1      2
2      2
3      2
4      2
      ..
886    2
887    1
888    4
889    2
890    2
Name: Age_class, Length: 891, dtype: int64

# 두 컬럼을 묶기

In [32]:
df_train["SP"] = df_train["SibSp"] + df_train["Parch"]
#동반가족인 두 컬럼을 굳이 나눌 필요가 없으므로 합친다.+연산자로 !
df_train.SP = df_train.SibSp + df_train.Parch

In [33]:
df_train.SP

0      1
1      1
2      0
3      1
4      0
      ..
886    0
887    0
888    3
889    0
890    0
Name: SP, Length: 891, dtype: int64

In [34]:
# 컬럼 Drop하기

In [35]:
df_train = df_train.drop(labels=["SibSp","Parch"], axis=1)
# df_train.drop(labels=["SibSp","Parch"], axis=1, inplace=True)#굳이 다시 안담아도대

In [36]:
df_train.head()

,Survived,Pclass,Name,Sex,Age,Ticket,Fare,Cabin,Embarked,MM,Age_class,SP
0,0,3,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500,N,S,Mr,2,1
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C85,C,Mrs,2,1
2,1,3,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.9250,N,S,Miss,2,0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,C123,S,Mrs,2,1
4,0,3,"Allen, Mr. William Henry",male,35.0,373450,8.0500,N,S,Mr,2,0

### Ticket : 의미가 있겠지만... 사전 지식이 없어 이 컬럼을 어떻게 할 수 없으므로 이 컬럼은 날리도록 하겠다.(배경지식의 중요성)

In [37]:
df_train[df_train["Cabin"].isnull() == False]

,Survived,Pclass,Name,Sex,Age,Ticket,Fare,Cabin,Embarked,MM,Age_class,SP
0,0,3,"Braund, Mr. Owen Harris",male,22.000000,A/5 21171,7.2500,N,S,Mr,2,1
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,PC 17599,71.2833,C85,C,Mrs,2,1
2,1,3,"Heikkinen, Miss. Laina",female,26.000000,STON/O2. 3101282,7.9250,N,S,Miss,2,0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,113803,53.1000,C123,S,Mrs,2,1
4,0,3,"Allen, Mr. William Henry",male,35.000000,373450,8.0500,N,S,Mr,2,0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,"Montvila, Rev. Juozas",male,27.000000,211536,13.0000,N,S,Rev,2,0
887,1,1,"Graham, Miss. Margaret Edith",female,19.000000,112053,30.0000,B42,S,Miss,1,0
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,W./C. 6607,23.4500,N,S,Miss,2,3
889,1,1,"Behr, Mr. Karl Howell",male,26.000000,111369,30.0000,C148,C,Mr,2,0
890,0,3,"Dooley, Mr. Patrick",male,32.000000,370376,7.7500,N,Q,Mr,2,0

In [38]:
#알파벳 뽑아서

In [39]:
# df_train.drop(labels="PassengerId", axis=1)
# df_train = df_train.drop(labels=["SibSp","Parch"], axis=1)
drop_feature = ["Name","MM","Ticket","Fare","Cabin","Embarked", "Age"]
df_train = df_train.drop(labels=drop_feature, axis=1)

In [40]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Survived   891 non-null    int64
 1   Pclass     891 non-null    int64
 2   Sex        891 non-null    object
 3   Age        891 non-null    float64
 4   Age_class  891 non-null    int64
 5   SP         891 non-null    int64
dtypes: float64(1), int64(4), object(1)
memory usage: 41.9+ KB

EDA과정에서 PCA(새로운,의미있는 컬럼을 추가) 클래스구간화 등  정규화 결측치이상치 제거
데이터 탐색 단계에서 데이터 셋 구경, 결측처리, 널 값 처리, 처리된 데이터 이용해서 가공,(가공전 가공 후 데이터) 시각화도 필요,
독립변수와의 상관분석을 하여서 의미있는 변수들 뽑아내기

In [41]:
#성별 인코딩
# LabelEnconder
from sklearn.preprocessing import LabelEncoder
features = ["Sex"]#, "Cabin"]
encoder = LabelEncoder() 
#===================fit() predict() 학습: fit에서 학습완료. 모든 작업 끝
#-------------------fit() transform() fit_transform() :: feature 변환(transform) :여기서 fit은 학습완료가 아니다. 모양만 맞춰놨고
# 변화는 transform할 때 실제로 일어난다.
# encoder.fit(df_train["Sex"])
# encoder.fit(df_train[["Sex", 'cabin']])
#---------------------------------인코딩한다 = Object -> 수치화(남: 0 , 여: 1)
for feature in features:
    encoder.fit(df_train[feature])
    df_train[feature] = encoder.transform(df_train[feature])
print(df_train["Sex"])

0      1
1      0
2      0
3      0
4      1
      ..
886    1
887    0
888    0
889    1
890    1
Name: Sex, Length: 891, dtype: int32

* 남녀남녀에서 0101로 바뀌었다

In [42]:
print(df_train.Sex.value_counts())

1    577
0    314
Name: Sex, dtype: int64

### 학습

In [43]:
from sklearn.model_selection import train_test_split

In [44]:
y_data = df_train.Survived
X_data = df_train.drop('Survived', axis=1)
X_train, X_test, y_train, y_test = train_test_split(X_data, y_data, test_size = 0.3, random_state= 11, shuffle=True)


from sklearn.tree import DecisionTreeClassifier
from sklearn.metrics import accuracy_score 
dt_model = DecisionTreeClassifier()
# 모델 준비 완료

In [45]:
dt_model.fit(X_train, y_train)
model_pred = dt_model.predict(X_test)
score = accuracy_score(y_test, model_pred )
print(score)

0.8059701492537313

In [52]:
from sklearn.metrics import accuracy_score
from sklearn.metrics import f1_score
from sklearn.metrics import precision_score
from sklearn.metrics import recall_score
from sklearn.metrics import confusion_matrix
from sklearn.metrics import roc_auc_score

In [53]:
print("정확도 ",accuracy_score(y_test, model_pred))
print("F1:",f1_score(y_test, model_pred))
print("정밀도: ",precision_score(y_test, model_pred))
print("재현률(민감도):",recall_score(y_test, model_pred))
print("ROC:",confusion_matrix(y_test, model_pred))
print("ROC_AUC:",roc_auc_score(y_test, model_pred))

정확도  0.8059701492537313
F1: 0.711111111111111
정밀도:  0.7272727272727273
재현률(민감도): 0.6956521739130435
ROC: [[152  24]
 [ 28  64]]
ROC_AUC: 0.7796442687747035